emsesp/EMS-ESP32/src/core/system.cpp
    // list all entities
    if (!strcmp(cmd, F_(entities))) {
        for (JsonPair p : root) {
            if (p.value().is<JsonObject>()) {
                for (JsonPair p1 : p.value().as<JsonObject>()) {
                    JsonObject entity = output[std::string(p.key().c_str()) + "." + p1.key().c_str()].to<JsonObject>();
                    get_value_json(entity, p.key().c_str(), p1.key().c_str(), p1.value());
                }
            }
        }
        return true;
    }

    char * val = (char *)strstr(cmd, "/value");
    if (val) {
        *val = '\0';
    }

    char * slash = (char *)strchr(cmd, '/');
    if (slash) {
        *slash = '\0';
        slash++;
    }

    // list values for a jsonObject in system, e.g. /api/system/network
    if (!slash || !strcmp(slash, F_(info)) || !strcmp(slash, F_(values))) {
        for (JsonPair p : root) {
            if (Helpers::toLower(p.key().c_str()) == cmd && p.value().is<JsonObject>()) {
                for (JsonPair p1 : p.value().as<JsonObject>()) {
                    output[p1.key().c_str()] = p1.value().as<std::string>();
                }
                return true;
            }
        }
        return false;
    }

    // value info or api_data for a single value
    // Loop through all the key-value pairs in root to find the key, case independent
    if (slash) { // search the top level first
        for (JsonPair p : root) {
            if (p.value().is<JsonObject>() && Helpers::toLower(p.key().c_str()) == cmd) {
                for (JsonPair p1 : p.value().as<JsonObject>()) {
                    if (Helpers::toLower(p1.key().c_str()) == slash && !p1.value().is<JsonObject>()) {
                        if (val) {
                            output["api_data"] = p1.value().as<std::string>();
                            return true;
                        }
                        get_value_json(output, p.key().c_str(), p1.key().c_str(), p1.value());
                        return true;
                    }
                }
            } // else skip, but we don't have value pairs in system root
        }
    }
    return false;
}

void System::get_value_json(JsonObject output, const std::string & circuit, const std::string & name, JsonVariant val) {
    output["name"] = name;
    if (circuit.length()) {
        output["circuit"] = circuit;
    }
    output["readable"]  = true;
    output["writeable"] = (name == "showerTimer" || name == "showerAlert" || name == "enabled" || name == "hideLed" || name == "analogEnabled");
    output["visible"]   = true;
    if (val.is<bool>()) {
        output["value"] = val.as<bool>();
        output["type"]  = "boolean";
    } else if (val.is<float>() || val.is<int>()) {
        output["value"] = val.as<float>();
        output["type"]  = "number";
    } else {
        output["value"] = val.as<std::string>();
        output["type"]  = "string";
    }
}

// generate Prometheus metrics format from system values
std::string System::get_metrics_prometheus() {
    std::string result;
    std::unordered_map<std::string, bool> seen_metrics;

    // get system data
    JsonDocument doc;
    JsonObject   root = doc.to<JsonObject>();
    (void)command_info("", 0, root);

    // helper function to escape Prometheus label values
    auto escape_label = [](const std::string & str) -> std::string {
        std::string escaped;
        for (char c : str) {
            if (c == '\\') {
                escaped += "\\\\";
            } else if (c == '"') {
                escaped += "\\\"";
            } else if (c == '\n') {
                escaped += "\\n";
            } else {
                escaped += c;
            }
        }
        return escaped;
    };

    // helper function to sanitize metric name (convert to lowercase and replace dots with underscores)
    auto sanitize_name = [](const std::string & name) -> std::string {
        std::string sanitized = name;
        for (char & c : sanitized) {
            if (c == '.') {
                c = '_';
            } else if (isupper(c)) {
                c = tolower(c);
            } else if (!isalnum(c) && c != '_') {
                c = '_';
            }
        }
        return sanitized;
    };

    // helper function to convert label name to lowercase
    auto to_lowercase = [](const std::string & str) -> std::string {
        std::string result = str;
        for (char & c : result) {
            if (isupper(c)) {
                c = tolower(c);
            }
        }
        return result;
    };

    // helper function to check if a field should be ignored
    auto should_ignore = [](const std::string & path, const std::string & key) -> bool {
        if (path == "system" && key == "uptime") {
            return true;
        }
        if (path == "ntp" && key == "timestamp") {
            return true;
        }
        if (path.find("devices[") != std::string::npos) {
            if (key == "handlersReceived" || key == "handlersFetched" || key == "handlersPending" || key == "handlersIgnored") {
                return true;
            }
        }
        return false;
    };

    // helper function to process a JSON object recursively
    std::function<void(const JsonObject &, const std::string &)> process_object =
        [&](const JsonObject & obj, const std::string & prefix) {
            std::vector<std::pair<std::string, std::string>> local_info_labels;
            bool has_nested_objects = false;

            for (JsonPair p : obj) {
                std::string key   = p.key().c_str();
                std::string path  = prefix.empty() ? key : prefix + "." + key;
                std::string metric_name = prefix.empty() ? key : prefix + "_" + key;

                if (should_ignore(prefix, key)) {
                    continue;
                }

                if (p.value().is<JsonObject>()) {
                    // recursive call for nested objects
                    has_nested_objects = true;
                    process_object(p.value().as<JsonObject>(), metric_name);
                } else if (p.value().is<JsonArray>()) {
                    // handle arrays (devices)
                    if (key == "devices") {
                        JsonArray devices = p.value().as<JsonArray>();
                        for (JsonObject device : devices) {
                            std::vector<std::pair<std::string, std::string>> device_labels;

                            // collect labels from device object
                            for (JsonPair dp : device) {
                                std::string dkey = dp.key().c_str();
                                if (dkey == "type" || dkey == "name" || dkey == "deviceID" || dkey == "brand" || dkey == "version") {
                                    if (dp.value().is<const char *>()) {
                                        std::string val = dp.value().as<const char *>();
                                        if (!val.empty()) {
                                            device_labels.push_back({to_lowercase(dkey), val});
                                        }
                                    }
                                }
                            }

                            // create productID metric
                            if (device.containsKey("productID") && device["productID"].is<int>()) {
                                std::string metric = "emsesp_device_productid";
                                if (seen_metrics.find(metric) == seen_metrics.end()) {
                                    result += "# HELP emsesp_device_productid productID\n";
                                    result += "# TYPE emsesp_device_productid gauge\n";
                                    seen_metrics[metric] = true;
                                }

                                result += metric;
                                if (!device_labels.empty()) {
                                    result += "{";
                                    bool first = true;
                                    for (const auto & label : device_labels) {
                                        if (!first) {
                                            result += ", ";
                                        }
                                        result += label.first + "=\"" + escape_label(label.second) + "\"";
                                        first = false;
                                    }
                                    result += "}";
                                }
                                result += " " + std::to_string(device["productID"].as<int>()) + "\n";
                            }

                            // create entities metric
                            if (device.containsKey("entities") && device["entities"].is<int>()) {
                                std::string metric = "emsesp_device_entities";
                                if (seen_metrics.find(metric) == seen_metrics.end()) {
                                    result += "# HELP emsesp_device_entities entities\n";
                                    result += "# TYPE emsesp_device_entities gauge\n";
                                    seen_metrics[metric] = true;
                                }

                                result += metric;
                                if (!device_labels.empty()) {
                                    result += "{";
                                    bool first = true;
                                    for (const auto & label : device_labels) {
                                        if (!first) {
                                            result += ", ";
                                        }
                                        result += label.first + "=\"" + escape_label(label.second) + "\"";
                                        first = false;
                                    }
                                    result += "}";
                                }
                                result += " " + std::to_string(device["entities"].as<int>()) + "\n";
                            }
                        }
                    }
                } else {
                    // handle primitive values
                    bool is_number = p.value().is<int>() || p.value().is<float>();
                    bool is_bool   = p.value().is<bool>();
                    bool is_string = p.value().is<const char *>();

