emsesp/EMS-ESP32/src/core/system.cpp
                    if (is_number || is_bool) {
                        // add metric
                        std::string full_metric_name = "emsesp_" + sanitize_name(metric_name);
                        if (seen_metrics.find(full_metric_name) == seen_metrics.end()) {
                            result += "# HELP emsesp_" + sanitize_name(metric_name) + " " + key + "\n";
                            result += "# TYPE emsesp_" + sanitize_name(metric_name) + " gauge\n";
                            seen_metrics[full_metric_name] = true;
                        }

                        result += full_metric_name + " ";
                        if (is_bool) {
                            result += p.value().as<bool>() ? "1" : "0";
                        } else if (p.value().is<int>()) {
                            result += std::to_string(p.value().as<int>());
                        } else {
                            char val_str[30];
                            snprintf(val_str, sizeof(val_str), "%.2f", p.value().as<float>());
                            result += val_str;
                        }
                        result += "\n";
                    } else if (is_string) {
                        // collect string for info metric (skip dynamic strings like uptime and timestamp)
                        std::string val = p.value().as<const char *>();
                        if (!val.empty() && key != "uptime" && key != "timestamp") {
                            local_info_labels.push_back({to_lowercase(key), val});
                        }
                    }
                }
            }

            // create _info metric for this object level if we have labels and this is a leaf node (no nested objects)
            if (!local_info_labels.empty() && !prefix.empty() && !has_nested_objects) {
                std::string info_metric = "emsesp_" + sanitize_name(prefix) + "_info";
                if (seen_metrics.find(info_metric) == seen_metrics.end()) {
                    result += "# HELP " + info_metric + " info\n";
                    result += "# TYPE " + info_metric + " gauge\n";
                    seen_metrics[info_metric] = true;
                }

                result += info_metric;
                if (!local_info_labels.empty()) {
                    result += "{";
                    bool first = true;
                    for (const auto & label : local_info_labels) {
                        if (!first) {
                            result += ", ";
                        }
                        result += label.first + "=\"" + escape_label(label.second) + "\"";
                        first = false;
                    }
                    result += "}";
                }
                result += " 1\n";
            }
        };

    // process root object
    process_object(root, "");

    return result;
}

// export status information including the device information
// http://ems-esp/api/system/info
bool System::command_info(const char * value, const int8_t id, JsonObject output) {
    JsonObject node;

    // System
    node = output["system"].to<JsonObject>();
// prevent false-negatives in Unity tests every time the version changes
#if defined(EMSESP_UNITY)
    node["version"] = "dev";
#else
    node["version"] = EMSESP_APP_VERSION;
#endif
    node["uptime"]    = uuid::log::format_timestamp_ms(uuid::get_uptime_ms(), 3);
    node["uptimeSec"] = uuid::get_uptime_sec();
#ifndef EMSESP_STANDALONE
    node["platform"]        = EMSESP_PLATFORM;
    node["cpuType"]         = ESP.getChipModel();
    node["arduino"]         = ARDUINO_VERSION;
    node["sdk"]             = ESP.getSdkVersion();
    node["freeMem"]         = getHeapMem();
    node["maxAlloc"]        = getMaxAllocMem();
    node["freeCaps"]        = heap_caps_get_free_size(MALLOC_CAP_8BIT) / 1024;      // includes heap and psram
    node["usedApp"]         = EMSESP::system_.appUsed();                            // kilobytes
    node["freeApp"]         = EMSESP::system_.appFree();                            // kilobytes
    node["partition"]       = (const char *)esp_ota_get_running_partition()->label; // active partition
    node["flash_chip_size"] = ESP.getFlashChipSize() / 1024;                        // kilobytes
#endif
    node["resetReason"] = EMSESP::system_.reset_reason(0) + " / " + EMSESP::system_.reset_reason(1);
#ifndef EMSESP_STANDALONE
    node["psram"] = (EMSESP::system_.PSram() > 0); // make boolean
    if (EMSESP::system_.PSram()) {
        node["psramSize"] = EMSESP::system_.PSram();
        node["freePsram"] = ESP.getFreePsram() / 1024;
    }
    node["model"] = EMSESP::system_.getBBQKeesGatewayDetails();
#if CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32C3 || CONFIG_IDF_TARGET_ESP32S2
    node["temperature"] = EMSESP::system_.temperature();
#endif

#endif

    // Network Status
    node = output["network"].to<JsonObject>();
#ifndef EMSESP_STANDALONE
    if (EMSESP::system_.ethernet_connected()) {
        node["network"]  = "Ethernet";
        node["hostname"] = ETH.getHostname();
        // node["MAC"]             = ETH.macAddress();
        // node["IPv4 address"]    = uuid::printable_to_string(ETH.localIP()) + "/" + uuid::printable_to_string(ETH.subnetMask());
        // node["IPv4 gateway"]    = uuid::printable_to_string(ETH.gatewayIP());
        // node["IPv4 nameserver"] = uuid::printable_to_string(ETH.dnsIP());
        // if (ETH.localIPv6().toString() != "0000:0000:0000:0000:0000:0000:0000:0000") {
        //     node["IPv6 address"] = uuid::printable_to_string(ETH.localIPv6());
        // }
    } else if (WiFi.status() == WL_CONNECTED) {
        node["network"]        = "WiFi";
        node["hostname"]       = WiFi.getHostname();
        node["RSSI"]           = WiFi.RSSI();
        node["WIFIReconnects"] = EMSESP::esp32React.getWifiReconnects();
        // node["MAC"]             = WiFi.macAddress();
        // node["IPv4 address"]    = uuid::printable_to_string(WiFi.localIP()) + "/" + uuid::printable_to_string(WiFi.subnetMask());
        // node["IPv4 gateway"]    = uuid::printable_to_string(WiFi.gatewayIP());
        // node["IPv4 nameserver"] = uuid::printable_to_string(WiFi.dnsIP());
        // if (WiFi.localIPv6().toString() != "0000:0000:0000:0000:0000:0000:0000:0000") {
        //     node["IPv6 address"] = uuid::printable_to_string(WiFi.localIPv6());
        // }
    }
#else
    // for testing
    node["network"]  = "WiFi";
    node["hostname"] = "ems-esp";
    node["RSSI"]     = -23;
#endif
    EMSESP::esp32React.getNetworkSettingsService()->read([&](NetworkSettings & settings) {
        if (WiFi.status() == WL_CONNECTED && !settings.bssid.isEmpty()) {
            node["BSSID"] = "set"; // we don't disclose the name
        }
        node["TxPowerSetting"] = settings.tx_power;
        node["staticIP"]       = settings.staticIPConfig;
        node["lowBandwidth"]   = settings.bandwidth20;
        node["disableSleep"]   = settings.nosleep;
        node["enableMDNS"]     = settings.enableMDNS;
        node["enableCORS"]     = settings.enableCORS;
        if (settings.enableCORS) {
            node["CORSOrigin"] = settings.CORSOrigin;
        }
    });

